require "model.util"


subs={
  {"π","math.pi"},
  {"α",""},
  {"β",""},
  {"γ",""},
  {"δ",""},
  {"ε",""},
  {"ζ",""},
  {"η",""},
  {"θ",""},
  {"λ",""},
  {"μ",""},
  {"ν",""},
  {"ξ",""},
  {"ρ",""},
  {"σ",""},
  {"τ",""},
  {"υ",""},
  {"φ",""},
  {"χ",""},
  {"ω",""},
  {"Γ",""},
  {"Δ",""},
  {"Λ",""},
  {"Ξ",""},
  {"Π",""},
  {"Σ",""},
  {"Φ",""},
  {"Ψ",""},
  {"Ω",""},
  {"Э",""},
  {"📬","function"},
  {"❗️","~"},
  {"❓","=="},
  {"🔍","=="},
  {"🎲","math.random"},
  {"😋"," print([[ Duolang supports emoji ! ]]}, "},
  {"👌","end"},
  {"💔","false"},
  {"❤️","true"},
  {"✊","then"},
  {"///","--"},
  {"👉","--"},
  {">>:","print"},
  {"✍","print"},
  {"👀","print"},
  {"<<:","return"},
  {"🐸","return"},
  {"😀","Emoji_1"},
  {"😆","Emoji_2"},
  {"☺️","Emoji_3"},
  {"🙃","Emoji_4"},
  {"😚","Emoji_5"},
  {"😜","Emoji_6"},
  {"😏","Emoji_7"},
  {"😟","Emoji_8"},
  {"😣","Emoji_9"},
  {"😅","Emoji_10"},
  {"😘","Emoji_11"},
  {"😋","Emoji_12"},
  {"😎","Emoji_13"},
  {"😖","Emoji_14"},
  {"😢","Emoji_15"},
  {"😂","Emoji_16"},
  {"😇","Emoji_17"},
  {"😌","Emoji_18"},
  {"😗","Emoji_19"},
  {"😛","Emoji_20"},
  {"😞","Emoji_21"},
  {"😫","Emoji_22"},
  {"😭","Emoji_23"},
  {"😍","Emoji_24"},
  {"😤","Emoji_25"},
  {"😡","Emoji_26"},
  {"😠","Emoji_27"},
  {"😳","Emoji_28"},
  {"😨","Emoji_29"},
  {"😰","Emoji_30"},
  {"😶","Emoji_31"},
  {"😐","Emoji_32"},
  {"😑","Emoji_33"},
  {"🙄","Emoji_34"},
  {"😮","Emoji_35"},
  {"😵","Emoji_36"},
  {"💦","Emoji_37"},
  {"😈","Emoji_38"},

}


code=io.open((import "model.SharedData").LuaEditRun_Path):read("*a")

if code==nil then
  print("?")
 else
  for n=1,#subs do
    code=string.gsub(code,subs[n][1],subs[n][2])
  end

  code=[[
require "model.util"

]]..code
  assert(loadstring(code))()
end


